src/test/taurus/prtbl-prod.yml
---
execution:
- concurrency: 10
  ramp-up: 10s
  hold-for: 30s
  scenario: simple
  
scenarios:
  simple:
    think-time: 0.25
    requests:
    - https://prtbl.herokuapp.com/
    - https://prtbl.herokuapp.com/elements/
    - https://prtbl.herokuapp.com/elements/1
reporting:
- module: junit-xml
  filename: .\junit\prtbl-prod.xml
  data-source: pass-fail
- module: passfail
  criteria:
    - avg-rt of IndexPage>150ms for 5s, stop as failed
    - fail of CheckoutPage>50% for 5s, stop as failed